DataProcessors/РасчетИндексацииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>РасчетИндексацииЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыданногоЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПроцентнойСтавки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСрокаЗайма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапитализацияПроцентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереноситьОплатыНаНачалоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьКрайниеМесяцы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикИндексации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИПЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиПроцентыЗаВесьПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияИПЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияИПЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияИПЦ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодИПЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_01_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_01_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100_ВБольшуюСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100_ВМеньшуюСторону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РасчетИндексацииЗадолженности/Ext/ObjectModule.bsl
Процедура ЗагрузитьГрафикНачислений() Экспорт
//	ТекущийДоговор = РасчетЗадолженностиМФО.ПолучитьТекущийДоговор(ЭтотОбъект.Займ, НачалоДня(ТекущаяДата()));
//	стрДатаРасчета = РасчетЗадолженностиМФО.ПолучитьДатуРасчетаСУчетомГоризонта(НачалоДня(ТекущаяДата()));
	Остатки = Неопределено; 
	ЭтотОбъект.ГрафикИндексации.Очистить();
	
	СписокПлатежей = ЭтотОбъект.ИсторияПлатежей.Выгрузить();
	СписокПлатежей.Сортировать("ДатаПлатежа");
	График = РассчитатьГрафикИндексации(ЭтотОбъект, СписокПлатежей); 
	//	
	//Для Каждого Элемент Из График Цикл
	//	стр = ЭтотОбъект.ГрафикИндексации.Добавить();
	//	ЗаполнитьЗначенияСвойств(стр, Элемент);
	//КонецЦикла;
	
	//Для Каждого Элемент из ЭтотОбъект.ТекущийДоговор.ГрафикПлатежей Цикл
	//	Если Элемент.СуммаПлатежа > 0 И Элемент.Дата <= стрДатаРасчета Тогда
	//		стр = ЭтотОбъект.ГрафикИндексации.НайтиСтроки(Новый Структура("Дата", Элемент.Дата))[0];
	//		стр.СуммаПлатежа_План = Элемент.СуммаПлатежа;
	//		стр.ОплатаОсновнойДолг_План = Элемент.ОплатаОсновнойДолг;
	//		стр.ОплатаПроценты_план = Элемент.ОплатаПроценты;
	//		стр.КУплате_план = Элемент.КУплате;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанные() Экспорт
	//ЭтотОбъект.ИсторияПлатежей.Очистить();
	ЭтотОбъект.Территория = "Свердловская область";
	ЭтотОбъект.ДатаРешения = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтотОбъект.Займ, "0498     ");
	ЭтотОбъект.СуммаЗадолженности = ЭтотОбъект.Займ.Замена_СуммаПоСудАкту;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(ЗадолженностьПоОбъектам.Период, ДЕНЬ) КАК ДатаПлатежа,
	                      |	ЗадолженностьПоОбъектам.СуммаДО КАК СуммаПлатежа
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектам КАК ЗадолженностьПоОбъектам
	                      |ГДЕ
	                      |	ЗадолженностьПоОбъектам.Объект = &Объект
	                      |	И ТИПЗНАЧЕНИЯ(ЗадолженностьПоОбъектам.Регистратор) = ТИП(документ.ПоступлениеПлатежей)");
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Займ);
	ЭтотОбъект.ИсторияПлатежей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Функция РассчитатьГрафикИндексации(стрДанные, СписокПлатежей)
	//Если стрДанные.ПереноситьОплатыНаНачалоМесяца Тогда
	//	Для Каждого Платеж Из СписокПлатежей Цикл
	//		Платеж.ДатаПлатежа = НачалоМесяца(Платеж.ДатаПлатежа); //НачалоДня(КонецМесяца(Платеж.ДатаПлатежа));	
	//	КонецЦикла;
	//	Запрос = Новый Запрос("ВЫБРАТЬ
	//	                      |	СписокПлатежей.СуммаПлатежа КАК СуммаПлатежа,
	//	                      |	СписокПлатежей.ДатаПлатежа КАК ДатаПлатежа
	//	                      |ПОМЕСТИТЬ вт_Платежи
	//	                      |ИЗ
	//	                      |	&СписокПлатежей КАК СписокПлатежей
	//	                      |;
	//	                      |
	//	                      |////////////////////////////////////////////////////////////////////////////////
	//	                      |ВЫБРАТЬ
	//	                      |	вт_Платежи.ДатаПлатежа КАК ДатаПлатежа,
	//	                      |	СУММА(вт_Платежи.СуммаПлатежа) КАК СуммаПлатежа
	//	                      |ИЗ
	//	                      |	вт_Платежи КАК вт_Платежи
	//	                      |
	//	                      |СГРУППИРОВАТЬ ПО
	//	                      |	вт_Платежи.ДатаПлатежа");
	//	Запрос.УстановитьПараметр("СписокПлатежей", СписокПлатежей);
	//	СписокПлатежей = Запрос.Выполнить().Выгрузить();
	//КонецЕсли;

	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СписокПлатежей.СуммаПлатежа КАК СуммаПлатежа,
	                      |	СписокПлатежей.ДатаПлатежа КАК ДатаПлатежа
	                      |ПОМЕСТИТЬ вт_Платежи
	                      |ИЗ
	                      |	&СписокПлатежей КАК СписокПлатежей
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Платежи.ДатаПлатежа КАК ДатаПлатежа,
	                      |	вт_Платежи.СуммаПлатежа КАК СуммаПлатежа,
	                      |	НАЧАЛОПЕРИОДА(вт_Платежи.ДатаПлатежа, МЕСЯЦ) КАК МесяцСписания
	                      |ИЗ
	                      |	вт_Платежи КАК вт_Платежи
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	МесяцСписания,
	                      |	ДатаПлатежа");
	Запрос.УстановитьПараметр("СписокПлатежей", СписокПлатежей);
	СписокПлатежей = Запрос.Выполнить().Выгрузить();	
	
	БазаНачисления = стрДанные.СуммаЗадолженности;
	КУплате = стрДанные.СуммаЗадолженности;
	ОстаткиОсновнойДолг = стрДанные.СуммаЗадолженности;
	ОстаткиПроценты = 0;
		
	Капитализация = стрДанные.КапитализацияПроцентов;
	
	Если стрДанные.ИсключитьКрайниеМесяцы Тогда
		стрДатаРасчета = НачалоМесяца(стрДанные.ДатаРасчета) - 24*3600;
		НачалоПериода = КонецМесяца(стрДанные.ДатаРешения) + 1;
	Иначе
		стрДатаРасчета = стрДанные.ДатаРасчета;
		НачалоПериода = стрДанные.ДатаРешения;
	КонецЕсли;
	//Если стрДанные.ПереноситьОплатыНаНачалоМесяца Тогда
	//	Пока НачалоПериода <= стрДатаРасчета Цикл
	//		стр = ЭтотОбъект.ГрафикИндексации.Добавить();
	//		
	//		стр.НачалоПериода = НачалоПериода;
	//		
	//		КонецПериода = мин(стрДатаРасчета, НачалоДня(КонецМесяца(НачалоПериода)));
	//		
	//		Платежи = СписокПлатежей.НайтиСтроки(Новый Структура("ДатаПлатежа", НачалоПериода));
	//		Если Платежи.Количество() > 0 Тогда
	//			стр.СуммаПлатежа = Платежи[0].СуммаПлатежа;
	//		КонецЕсли;
	//		стр.КонецПериода = КонецПериода;
	//		
	//		НачалоПериода = КонецПериода + 24*3600;
	//	КонецЦикла;	
	//Иначе
	//	
	//КонецЕсли;
	
	Пока НачалоПериода <= стрДатаРасчета Цикл
		Платежи = СписокПлатежей.НайтиСтроки(Новый Структура("МесяцСписания", НачалоПериода));
		Для Каждого Платеж Из Платежи Цикл
			стр = ЭтотОбъект.ГрафикИндексации.Добавить();
			стр.НачалоПериода = Платеж.ДатаПлатежа;
			стр.СуммаПлатежа = Платеж.СуммаПлатежа;
		КонецЦикла;

		
		стр = ЭтотОбъект.ГрафикИндексации.Добавить();
		
		стр.НачалоПериода = НачалоПериода;
		
		КонецПериода = мин(стрДатаРасчета, НачалоДня(КонецМесяца(НачалоПериода)));
		
		стр.КонецПериода = КонецПериода;
		
		НачалоПериода = КонецПериода + 24*3600;
	КонецЦикла;	
	
	
	Для Каждого стр Из ЭтотОбъект.ГрафикИндексации Цикл
		Если Капитализация Тогда
			БазаНачисления = КУплате;
		Иначе
			БазаНачисления = ОстаткиОсновнойДолг;
		КонецЕсли;
		стр.Сумма = БазаНачисления;
		СуммаПлатежа = стр.СуммаПлатежа;

		Если СуммаПлатежа = 0 Тогда
			стр.Дни = (стр.КонецПериода - стр.НачалоПериода)/24/3600 + 1;
			стр.ИПЦ = ПолучитьЗначениеИПЦ(НачалоМесяца(стр.НачалоПериода));
			
			КоличествоДнейВМесяце = КоличествоДнейВМесяце(стр.НачалоПериода);
			
			
			
			
			
			стр.Проценты = ?(стр.ИПЦ > 0, РасчетЗадолженностиМФО.ОкруглитьЧисло((стр.ИПЦ - 100) * БазаНачисления * стр.Дни / КоличествоДнейВМесяце / 100, Перечисления.ПорядкиОкругления.Окр0_01), 0);
		КонецЕсли;
		
		стр.ОстаткиОсновнойДолг = ОстаткиОсновнойДолг;
		стр.ОстаткиПроценты = ОстаткиПроценты + стр.Проценты;
		
				
		Если СуммаПлатежа > 0 И Капитализация Тогда
			стр.ОплатаПроценты = мин(стр.ОстаткиПроценты, СуммаПлатежа);
			стр.ОстаткиПроценты = стр.ОстаткиПроценты - стр.ОплатаПроценты;
			СуммаПлатежа = СуммаПлатежа - стр.ОплатаПроценты;
		КонецЕсли;
		
		Если СуммаПлатежа > 0 Тогда
			стр.ОплатаОсновнойДолг = мин(стр.ОстаткиОсновнойДолг, СуммаПлатежа);
			стр.ОстаткиОсновнойДолг = стр.ОстаткиОсновнойДолг - стр.ОплатаОсновнойДолг;
			СуммаПлатежа = СуммаПлатежа - стр.ОплатаОсновнойДолг;
		КонецЕсли; 
		стр.Переплата = СуммаПлатежа;
		стр.КУплате = стр.ОстаткиОсновнойДолг + стр.ОстаткиПроценты;
		
		КУплате = стр.КУплате;
		ОстаткиПроценты = стр.ОстаткиПроценты;
		ОстаткиОсновнойДолг = стр.ОстаткиОсновнойДолг;
 
		
	//	НачалоПериода = КонецПериода + 24*3600;
	КонецЦикла;
КонецФункции

Функция ПолучитьЗначениеИПЦ(Период)
	Менеджер = РегистрыСведений.ЗначенияИПЦ.СоздатьМенеджерЗаписи();
	Менеджер.ПериодИПЦ = Период;
	Менеджер.Территория = ЭтотОбъект.Территория;
	
	Менеджер.Прочитать();
	Возврат Менеджер.Значение;
КонецФункции

Функция КоличествоДнейВМесяце(Период)
	Возврат (НачалоДня(КонецМесяца(Период)) - НачалоМесяца(Период))/3600/24 + 1;
КонецФункции
